<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5fe41ce896f197d13bdfbab7910be06259711ec642d1404ebe3b6630832bfd88","plan_job_ref":"Job terraform plan #114 at https://github.com/suzutan/infra/actions/runs/15767089251","plan_out_hash":"d7e60b2221b58dda001befc6820c8efa083c4a8a95149f1859008b6ff7bb25bb","plan_hash":"4992f05f6ee3b8747d8009513c8b0c116ddc30a12921cd73e664941030f637e6","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress will be updated in-place
!~  resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
!~      config     = {
!~          ingress      = [
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
-                       connect_timeout        = 10 -> null
-                       keep_alive_connections = 100 -> null
-                       keep_alive_timeout     = 90 -> null
-                       no_happy_eyeballs      = false -> null
-                       tcp_keep_alive         = 30 -> null
-                       tls_timeout            = 10 -> null
#                        (5 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
#                (1 unchanged element hidden)
            ]
!~          warp_routing = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-06-01T08:40:16Z" -> (known after apply)
        id         = "36d574cb-f554-4320-a995-61af899df181"
!~      source     = "cloudflare" -> (known after apply)
!~      version    = 3 -> (known after apply)
#        (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #114](https://github.com/suzutan/infra/actions/runs/15767089251)